Revit 2027 API
BarTypeDiameterOptions.StirrupTieBendDiameter Property
 Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StirrupTieBendDiameter { get; set; }
Public Property StirrupTieBendDiameter As Double
	Get
	Set
public:
property double StirrupTieBendDiameter {
	double get ();
	void set (double value);
}
member StirrupTieBendDiameter : float with get, set
Property Value
Double
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace